In [1]:
import numpy as np
import pandas as pd

In [2]:
data = pd.Series([0,2,4,6,np.nan,8,10,12])

In [3]:
data

0     0.0
1     2.0
2     4.0
3     6.0
4     NaN
5     8.0
6    10.0
7    12.0
dtype: float64

In [4]:
data.isnull()

0    False
1    False
2    False
3    False
4     True
5    False
6    False
7    False
dtype: bool

In [5]:
data.notnull()

0     True
1     True
2     True
3     True
4    False
5     True
6     True
7     True
dtype: bool

In [7]:
dict1 = {
    0:[2,6,12,np.nan],
    1:[4,10,np.nan,np.nan],
    2:[6,np.nan,np.nan,np.nan],
    3:[np.nan,np.nan,np.nan,np.nan]
}
df = pd.DataFrame(dict1)
df

      0     1    2   3
0   2.0   4.0  6.0 NaN
1   6.0  10.0  NaN NaN
2  12.0   NaN  NaN NaN
3   NaN   NaN  NaN NaN

In [8]:
df.dropna()

Empty DataFrame
Columns: [0, 1, 2, 3]
Index: []

In [9]:
df.dropna(how='all')

      0     1    2   3
0   2.0   4.0  6.0 NaN
1   6.0  10.0  NaN NaN
2  12.0   NaN  NaN NaN

In [10]:
df.dropna(axis=1, how='all')

      0     1    2
0   2.0   4.0  6.0
1   6.0  10.0  NaN
2  12.0   NaN  NaN
3   NaN   NaN  NaN

In [11]:
df.dropna(thresh=1)

      0     1    2   3
0   2.0   4.0  6.0 NaN
1   6.0  10.0  NaN NaN
2  12.0   NaN  NaN NaN

In [12]:
df.dropna(thresh=1,axis=1)

      0     1    2
0   2.0   4.0  6.0
1   6.0  10.0  NaN
2  12.0   NaN  NaN
3   NaN   NaN  NaN

In [13]:
df_fill = df.fillna(10)
df_fill

      0     1     2     3
0   2.0   4.0   6.0  10.0
1   6.0  10.0  10.0  10.0
2  12.0  10.0  10.0  10.0
3  10.0  10.0  10.0  10.0

 #### to fill nan place with any value

In [15]:
df_fill = df.fillna({0:10,2:20,3:30})
df_fill

      0     1     2     3
0   2.0   4.0   6.0  30.0
1   6.0  10.0  20.0  30.0
2  12.0   NaN  20.0  30.0
3  10.0   NaN  20.0  30.0

In [16]:
df_fill = df.fillna(method='ffill')
df_fill

      0     1    2   3
0   2.0   4.0  6.0 NaN
1   6.0  10.0  6.0 NaN
2  12.0  10.0  6.0 NaN
3  12.0  10.0  6.0 NaN

#### upr ki sm value niche k blank plc pr fill ho jayegy

In [19]:
df = df.fillna(method = "bfill")
df

      0     1    2   3
0   2.0   4.0  6.0 NaN
1   6.0  10.0  NaN NaN
2  12.0   NaN  NaN NaN
3   NaN   NaN  NaN NaN

## niche ki sm value upr blnk plc me fill hogy bt yha nhi hui q ki apne data me vesi info nhi h

In [17]:
df_fill = df.fillna(method='ffill', limit=2)
df_fill

      0     1    2   3
0   2.0   4.0  6.0 NaN
1   6.0  10.0  6.0 NaN
2  12.0  10.0  6.0 NaN
3  12.0  10.0  NaN NaN

In [18]:
df_mean = df.fillna(df.mean())
df_mean

           0     1    2   3
0   2.000000   4.0  6.0 NaN
1   6.000000  10.0  6.0 NaN
2  12.000000   7.0  6.0 NaN
3   6.666667   7.0  6.0 NaN

In [20]:
ser1 = pd.Series([1,2,100,4,5,100,7,8,100])
ser1

0      1
1      2
2    100
3      4
4      5
5    100
6      7
7      8
8    100
dtype: int64

In [21]:
ser1.replace(100,1)

0    1
1    2
2    1
3    4
4    5
5    1
6    7
7    8
8    1
dtype: int64

In [22]:
ser1.replace([100, 2, 1], 50)

0    50
1    50
2    50
3     4
4     5
5    50
6     7
7     8
8    50
dtype: int64

In [23]:
ser1.replace({100: np.nan, 1 :25})

0    25.0
1     2.0
2     NaN
3     4.0
4     5.0
5     NaN
6     7.0
7     8.0
8     NaN
dtype: float64

In [24]:
ser2=pd.Series(list('abcdeabcd'))
ser2

0    a
1    b
2    c
3    d
4    e
5    a
6    b
7    c
8    d
dtype: object

In [25]:
pd.get_dummies(ser2)

   a  b  c  d  e
0  1  0  0  0  0
1  0  1  0  0  0
2  0  0  1  0  0
3  0  0  0  1  0
4  0  0  0  0  1
5  1  0  0  0  0
6  0  1  0  0  0
7  0  0  1  0  0
8  0  0  0  1  0